[
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "App-Devlopment",
    "image":"..\\assets\\courses\\udemy\\001.png",
    "title": "Flutter & Dart - The Complete Guide [2022 Edition]",
    "discription": "A Complete Guide to the Flutter SDK & Flutter Framework for building native iOS and Android apps",
    "link": "https://www.udemy.com/course/learn-flutter-dart-to-build-ios-android-apps/",
    "detail_link": "empty",
    "rating": 4.6,
    "hours": 42,
    "downloadable_resourse": 312,
    "learn": [
      "Learn Flutter and Dart from the ground up",
      "step-by-stepBuild engaging native mobile apps for both Android and iOS",
      "Use features like Google Maps, the device camera, authentication and much more!",
      "Learn how to upload images and how to send manual and automated push notifications",
      "Learn all the basics without stopping after them: Dive deeply into Flutter & Dart and become an advanced developer"
    ]
  },
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "Web-Devlopment",
    "image":"../assets/courses/udemy/002.png",
    "title": "The Complete 2022 Web Development Bootcamp",
    "discription": "Become a Full-Stack Web Developer with just ONE course. HTML, CSS, Javascript, Node, React, MongoDB, Web3 and DApps",
    "link": "https://www.udemy.com/course/the-complete-web-development-bootcamp/",
    "detail_link": "empty",
    "rating": 4.7,
    "hours": 65,
    "downloadable_resourse": 49,
    "learn": [
      "You will build 16 web development projects for your portfolio",
      "ready to apply for junior developer jobs",
      " You will learn the latest technologies, including Javascript, React, Node and even Web3 development.",
      "You will master both front and back-end development, becoming a full-stack developer by the end of the course.",
      "After the course you will be able to build ANY website you want.",
      " Build fully-fledged websites and web apps for your startup or business.",
      "Work as a freelance web developer",
      "Master frontend development with React",
      "Master backend development with Node",
      " Learn professional developer best practices"
    ]
  },
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "Python in 100 Days",
    "image":"..\\assets\\courses\\udemy\\003.png",
    "title": "100 Days of Code: The Complete Python Pro Bootcamp for 2022",
    "discription": "Master Python by building 100 projects in 100 days. Learn data science, automation, build websites, games and apps!",
    "link": "https://www.udemy.com/course/100-days-of-code/",
    "detail_link": "empty",
    "rating": 4.7,
    "hours": 60,
    "downloadable_resourse": 128,
    "learn": [
      "You will master the Python programming language by building 100 unique projects over 100 days",
      "You will learn automation, game, app and web development, data science and machine learning all using Python",
      "You will be able to program in Python professionally",
      "You will learn Selenium, Beautiful Soup, Request, Flask, Pandas, NumPy, Scikit Learn, Plotly, and Matplotlib",
      "Create a portfolio of 100 Python projects to apply for developer jobs",
      "Be able to build fully fledged websites and web apps with Python",
      "Be able to use Python for data science and machine learning",
      "Build games like Blackjack, Pong and Snake using Python",
      "Build GUIs and Desktop applications with Python"
    ]
  },
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "Ethical Hacking",
    "image":"..\\assets\\courses\\udemy\\004.png",
    "title": "Learn Ethical Hacking From Scratch",
    "discription": "Become an ethical hacker that can hack computer systems like black hat hackers and secure them like security experts.",
    "link": "https://www.udemy.com/course/100-days-of-code/",
    "detail_link": "empty",
    "rating": 4.6,
    "hours": 16,
    "downloadable_resourse": 23,
    "learn": [
      "135+ ethical hacking & security videos",
      "Start from 0 up to a high-intermediate level",
      "Learn ethical hacking, its fields & the different types of hackers",
      "Install a hacking lab & needed software (on Windows, OS X and Linux)",
      "Hack & secure both WiFi & wired networks",
      "Understand how websites work, how to discover & exploit web application vulnerabilities to hack websites",
      "Use 30+ hacking tools such as Metasploit, Aircrack-ng, SQLmap.....etc",
      "Discover vulnerabilities & exploit them to hack into servers",
      "Hack secure systems using client-side & social engineering",
      "Secure systems from all the attacks shown",
      "Install & use Kali Linux - a penetration testing operating system",
      "Learn linux basics",
      "Learn linux commands & how to interact with the terminal",
      "Learn Network Hacking / Penetration Testing",
      "Network basics & how devices interact inside a network",
      "Run attacks on networks without knowing its key",
      "Control Wi-Fi connections without knowing the password",
      "Create a fake Wi-Fi network with internet connection & spy on clients",
      "Gather detailed information about networks & connected clients like their OS, ports ...etc",
      "Crack WEP/WPA/WPA2 encryptions using a number of methods",
      "ARP Spoofing / ARP Poisoning",
      "Launch various Man In The Middle attacks",
      "Access any account accessed by any client on the network",
      "Sniff network traffic & analyse it to extract important info such as: passwords, cookies, urls, videos, images ..etc",
      "Intercept network traffic & modify it on the fly",
      "Discover devices connected to the same network",
      "Inject Javascript in pages loaded by clients connected to the same network",
      "Redirect DNS requests to any destination (DNS spoofing)",
      "Secure networks from the discussed attacks",
      "Edit router settings for maximum security",
      "Discover suspicious activities in networks",
      "Encrypt traffic to prevent MITM attacks",
      "Discover open ports, installed services and vulnerabilities on computer systems",
      "Hack servers using server side attacks",
      "Exploit buffer over flows & code execution vulnerabilities to gain control over systems",
      "Hack systems using client side attacks",
      "Hack systems using fake updates",
      "Hack systems by backdooring downloads on the fly",
      "Create undetectable backdoors",
      "Backdoor normal programs",
      "Backdoor any file type such as pictures, pdf's ...etc",
      "Gather information about people, such as emails, social media accounts, emails and friends",
      "Hack secure systems using social engineering",
      "Send emails from ANY email account without knowing the password for that account",
      "Analyse malware",
      "Manually detect undetectable malware",
      "Read, write download, upload and execute files on compromised systems.",
      "Capture keystrokes on a compromised system.",
      "Use a compromised computer as a pivot to hack other systems.",
      "Understand how websites & web applications work.",
      "Understand how browsers communicate with websites.",
      "Gather sensitive information about websites.",
      "Discover servers, technologies & services used on target website.",
      "Discover emails & sensitive data associated with a specific website.",
      "Discover subdomains associated with a website.",
      "Discover unpublished directories & files associated with a target website.",
      "Discover websites hosted on the same server as the target website.",
      "Exploit file upload vulnerabilities to gain control over target website.",
      "Discover, exploit and fix code execution vulnerabilities.",
      "Discover, exploit & fix local file inclusion vulnerabilities.",
      "Discover, exploit & fix SQL injection vulnerabilities.",
      "Bypass login forms and login as admin using SQL injections.",
      "Exploit SQL injections to find databases, tables & sensitive data such as usernames, passwords...etc",
      "Read / Write files to the server using SQL injections,",
      "Learn the right way to write SQL queries to prevent SQL injections,",
      "Discover reflected XSS vulnerabilities,",
      "Discover Stored XSS vulnerabilities,",
      "Hook victims to BeEF using XSS vulnerabilities,",
      "Fix XSS vulnerabilities & protect yourself from them as a user,",
      "Discover MITM & ARP Spoofing attacks,"
    ]
  },
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "Digital Marketing",
    "image":"..\\assets\\courses\\udemy\\005.png",
    "title": "Mega Digital Marketing Course A-Z: 12 Courses in 1 + Updates",
    "discription": "Digital Marketing Strategy, Social Media Marketing, WordPress, SEO, Digital Sale, Email, Instagram, Facebook, ads ..",
    "link": "https://www.udemy.com/course/digital-marketing-strategy-course-wordpress-seo-instagram-facebook/",
    "detail_link": "empty",
    "rating": 4.6,
    "hours": 68.5,
    "downloadable_resourse": 128,
    "learn": [
      "Find your target audience, easily convince them to become your customer and buy your products",
      "Build a effective website for marketing and sale from scratch (no coding!)",
      "Increase your conversion rate by building advanced landing pages, write powerful copies and sell more",
      "Earn extremely powerful knowledge of digital marketing strategies to use in any online platform to get results",
      "Grow your sales by doing successful email marketing, following step by step instructions to get results",
      "Inject constant traffic into your website & business with SEO, rank in the first page of Google & other search engines",
      "Become a master of social media marketing, grow your business on Facebook & Instagram and bring traffic to your website",
      "Get more customers by doing successful advertisement campaigns on different social media platforms",
      "Bring back the people who already visited your site by advanced retargeting",
      "Fix your buisiness problems before they even happen using Google analytics, to avoid expensive problems in your business"
    ]
  },
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "Graphic Desgining",
    "image":"..\\assets\\courses\\udemy\\006.png",
    "title": "Graphic Design Masterclass - Learn GREAT Design",
    "discription": "The Ultimate Graphic Design Course Which Covers Photoshop, Illustrator, InDesign,Design Theory, Branding and Logo Design",
    "link": "https://www.udemy.com/course/digital-marketing-strategy-course-wordpress-seo-instagram-facebook/",
    "detail_link": "empty",
    "rating": 4.7,
    "hours": 29,
    "downloadable_resourse": 48,
    "learn": [
      "Have a deep understanding of typography, color theory, photos, layout, blocking and other design theory and skills",
      "Understand and learn the essential tools and capabilities of Adobe Photoshop, Illustrator and InDesign",
      "Create logos and branding packages for potential clients",
      "Learn photo editing and manipulation in Adobe Photoshop",
      "Master the pen tool, shape builder tool and other essential vector design tools in Adobe Illustrator.",
      "How to create editorial spreads and magazine layouts using Adobe InDesign",
      "Understand solid logo design and ad design principles to create compelling campaigns and logos",
      "Work through the entire package design process",
      "Learn non-destructive editing techniques in Adobe Photoshop",
      "Work through an event flyer design to understand strong type hierarchy, balance and overall design layout",
      "Learn a few of the upcoming design trends for 2022 and how to create them!",
      "Learn the history of fonts and typefaces and how to pair fonts",
      "Learn the basics of Affinity Designer and learn the difference between Adobe Illustrator and Affinity Designer",
      "Work through a 7 page vector tracing worksheet and feel confident creating a complex vector illustration by the end of this worksheet",
      "NEW! Learn how to work with multiple page layouts in Adobe InDesign and create a cookbook cover and book",
      "NEW! Learn the step-by-step process to becoming a graphic designer",
      "NEW! Learn how to work with Photoshop Mockups to create great presentations",
      "NEW! Learn word mapping and brainstorming techniques to increase your creativity in logo design and branding projects",
      "NEW! Learn the Double Exposure Effect in Adobe Photoshop",
      "NEW! Create Vector Art in Adobe Illustrator",
      "NEW! Learn How to Encourage and Spark Creativity",
      "NEW! How to create YouTube thumbnails and social media graphics",
      "NEW! How to properly give and receive critiques and feedback",
      "NEW! Understand how to create 3d objects and typography in Adobe Illustrator",
      "NEW! Discover the latest 2022 updates to the Adobe software and understand the new artificial intelligence filters and tools",
      "NEW! Learn how to predict future design trends and complete projects that use the most up to date trends"
    ]
  },
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "UI/UX, Desgining",
    "image":"..\\assets\\courses\\udemy\\007.png",
    "title": "Complete Web & Mobile Designer in 2022: UI/UX, Figma, +more",
    "discription": "Become a Designer in 2022! Master Mobile and Web Design, User Interface + User Experience (UI/UX Design), HTML, and CSS",
    "link": "https://www.udemy.com/course/complete-web-designer-mobile-designer-zero-to-mastery/",
    "detail_link": "empty",
    "rating": 4.6,
    "hours": 27,
    "downloadable_resourse": 58,
    "learn": [
      "Build beautifully designed web and mobile projects for your customers using modern tools used by top companies in 2022",
      "Get hired as a Designer or become a freelancer that can work from anywhere and for anyone. Designers are in high demand!",
      "Includes 100+ assets and premium design templates that you can keep and use to customize for all your future projects",
      "Master Figma for your design needs then learn to convert your designs into a live HTML an CSS website",
      "Have an amazing design portfolio customized and professionally completed by the end of the course (we provide it for you!)",
      "Master both Web and Mobile design principles and how to go from sketching to fully fledged high fidelity designs that will wow customers",
      "Learn to design for all types of devices using Figma and other tools used by some of the top designers in the world",
      "Learn to use HTML5 and CSS3 to make your designs come to life and create fully working websites",
      "Learn best practices that takes years to learn in the design industry",
      "Learn to make professional logos and design choices for all branding needs",
      "Learn UI/UX best practices using the latest trends in the industry",
      "Learn to be a designer as well as a web developer at the same time (a rare combination of skills that is in high demand)!"
    ]
  },
  {
    "platform":"Udemy",
    "price":"3000-3500",
    "valid":"31-Aug",
    "type": "2D-3D Blender",
    "image":"..\\assets\\courses\\udemy\\008.png",
    "title": "Complete Blender Creator: Learn 3D Modelling for Beginners",
    "discription": "Use Blender to Create Beautiful 3D models for Video Games, 3D Printing & More. Beginners Level Course",
    "link": "https://www.udemy.com/course/become-a-game-designer/",
    "detail_link": "empty",
    "rating": 4.7,
    "hours": 45.5,
    "downloadable_resourse": 81,
    "learn": [
      "Use Blender and understand it's interface",
      "Understand the principles of modelling",
      "Create 3D models with simple colors",
      "Learn the basics of animation",
      "Create your own materials",
      "UV map and unwrap your models"
    ]
  },
  {
    "platform":"Udemy",
    "price":"2000",
    "valid":"31-Aug",
    "type": "C# Game-Devlopement",
    "image":"..\\assets\\courses\\udemy\\009.png",
    "title": "Complete C# Unity Game Developer 3D",
    "discription": "Design & Develop Video Games. Learn C# in Unity Engine. Code Your first 3D Unity games for web, Mac & PC.",
    "link": "https://www.udemy.com/course/unitycourse2/",
    "detail_link": "empty",
    "rating": 4.7,
    "hours": 85,
    "downloadable_resourse": 30.5,
    "learn": [
      "Learn C# from scratch. A powerful modern language",
      "Get experience using Unity 2020 - a very versatile 3D tool.",
      "Gain an excellent general knowledge of video game design.",
      "Make 2.5D and 3D games in Unity.",
      "Transfer your knowledge to .NET, other languages, and more.",
      "Learn how object oriented programming works in practice.",
      "Develop a positive attitude to problem solving.",
      "Practical exercises EVERY VIDEO to build actual skills.",
      "Learn good coding and design patterns.",
      "Learn to use source control, a valuable tool for working in small teams."
    ]
  },
  {
    "platform":"Youtube",
    "price":"",
    "valid":"",
    "type": "Demo",
    "image":"https://dummyimage.com/450x300/dee2e6/6c757d.jpg",
    "title": "Demo",
    "discription": "",
    "link": "",
    "detail_link": "empty",
    "rating": 4.7,
    "hours": 85,
    "downloadable_resourse": 30.5,
    "learn": [
      
    ]
  },
  {
    "platform":"Coursera",
    "price":"",
    "valid":"",
    "type": "Demo",
    "image":"https://dummyimage.com/450x300/dee2e6/6c757d.jpg",
    "title": "Demo",
    "discription": "",
    "link": "",
    "detail_link": "empty",
    "rating": 4.7,
    "hours": 85,
    "downloadable_resourse": 30.5,
    "learn": [
      
    ]
  }
]
